app/views/produtos/eps/_form_principal_E03.html.erb

SELECT id,descricao FROM "clases" ORDER BY 2
---
               <td align="right">Clase :</td>
               <td colspan="3"><%= f.collection_select :clase_id, Clase.all(:select => 'id,descricao',:order => '2'),:id,:descricao,{},{

SELECT id,descricao FROM "grupos" ORDER BY 2
---
                  Grupo :
                  <%= f.collection_select :grupo_id, Grupo.all(:select => 'id,descricao',:order => '2'),:id,:descricao,{},{

SELECT id,nome FROM "personas" WHERE (tipo_fornecedor = 1) ORDER BY 2
---
               <td align="right">Proveedor :</td>
               <td><%= f.collection_select :fabricante_id, Persona.all(:select => 'id,nome',:conditions =>['tipo_fornecedor = 1'],:order => '2'),:id,:nome,
               								{:include_blank => true },
               								{:onkeyup    => "EnterTab(event,'produto_fabricante_cod')",
                   		:onkeypress => "return bloqEnter(event)"} %></td>

SELECT "empresas".* FROM "empresas" LIMIT 1
---
              <!-- BASE CALCULOS DE PRECO DE VENDA !-->
              <%= hidden_field_tag :base_calc, Empresa.first.base_calc_preco_venda %>

SELECT "compras_produtos".* FROM "compras_produtos" WHERE "compras_produtos"."produto_id" = 6818 ORDER BY "compras_produtos"."id" DESC LIMIT 1
---
                     <td>Fecha Ult. Compra :</td>
                     <td><%= @produto.compras_produtos.last ? @produto.compras_produtos.last.data.strftime("%d/%m/%Y") : "00/00/0000" %></td>

SELECT "vendas_produtos".* FROM "vendas_produtos" WHERE "vendas_produtos"."produto_id" = 6818 ORDER BY "vendas_produtos"."id" DESC LIMIT 1
---
                     <td>Proveedor:</td>
                     <td colspan="2"><%= @produto.vendas_produtos.last ? @produto.vendas_produtos.last.persona_nome : "----" %></td>