app/views/meta_detalhes/_new_detalhes.html.erb

                    <td align="right">Setor :</td>
                      <td colspan="1"><%= f.collection_select :setor_id, Setor.all( :select => ' id,nome',
                                          :order  => '2' ), :id,
                                          :nome %></td>
---
SELECT id,nome FROM "setors" ORDER BY 2

                    <td align="right">Empleado :</td>
                    <td ><%= f.collection_select :persona_id, Persona.where("tipo_funcionario = 1", :select => ' id,nome',
                             :order  => '2' ), :id,
                             :nome %></td>
---
SELECT "personas".* FROM "personas" WHERE (tipo_funcionario = 1)