app/views/logins/new.html.erb

SELECT id,unidade_nome FROM "unidades" ORDER BY unidade_nome
---
		<br />
		<%= text_field_tag( 'unidade',nil,
	                                    :id       => "unidade",
	                                    :class    => "text_seach",
	                                    :onblur   => " $.ajax({url: '/buscas/get_unidade',
	                                    	 										type: 'POST',
         																										data: 'unidade=' + this.value,
           																									success: function(data){
             																								$('#busca_unidade_id').val(data);} })") %>

SELECT id,usuario_senha FROM "usuarios" WHERE (id = '1' and usuario_senha = 'di03051999') LIMIT 1
---
		<br />
		<%= text_field_tag( 'usuario', nil,
	                                 :id       => "unidade",
	                                 :class    => "text_seach",
	                                 :onblur => " $.ajax({url: '/buscas/get_usuario',
	                                   	 										type: 'POST',
         																									data: 'usuario=' + this.value,
           																								success: function(data){
             																							$('#busca_usuario_id').val(data);} })") %>