app/views/fechamento_caixas/_form.html.erb

	  			        <td align="right">Usuario :</td>
	  			        <td><%= f.collection_select :usuario_id, Persona.all(:select => 'id,nome',:conditions => ["tipo_funcionario = 1"], :order => '2'),:id,:nome %></td>
---
SELECT id,nome FROM "personas" WHERE (tipo_funcionario = 1) ORDER BY 2

	  			        <td align="right">Caja :</td>
	  			        <td><%= f.collection_select :conta_id, Conta.all(:select => 'id,nome',:conditions => ["tipo = 0"], :order => '2'),:id,:nome %></td>
---
SELECT id,nome FROM "contas" WHERE (tipo = 0) ORDER BY 2