app/views/contas/_form.html.erb

            <td align="right"><b>Unidade:</b></td>
            <td><%= f.collection_select :unidade_id, Unidade.all(:select => 'id',:order => '1'),:id,:id %></td>
---
SELECT id FROM "unidades" ORDER BY 1

          <td align="right"><b>Ciudad :</b></td>
          <td><%= f.collection_select :cidade_id, Cidade.all(:select => 'id,nome',:order => '2'),:id,:nome %></td>
---
SELECT id,nome FROM "cidades" ORDER BY 2

          <td align="right"><b>Rubro :</b></td>
          <td><%= f.collection_select :rubro_id, Rubro.all(:select => 'id,descricao,codigo',:order => 'descricao'),:id,:descricao %></td>
---
SELECT id,descricao,codigo FROM "rubros" ORDER BY descricao