app/views/metodos/_form.html.erb

                   <td align="right"> Equipo : </td>
                   <td> <%= f.collection_select :equipo_id, Equipo.all( :select     => ' id,descricao',
                                                          :conditions => ["status = 0"],
                                                          :order      => '2'),:id,:descricao, { :include_blank => true } %></td>
---
SELECT id,descricao FROM "equipos" WHERE (status = 0) ORDER BY 2

                    <td align="right">Var 01 </td>
                    <td><%= f.collection_select :var_01_id, Produto.all( :select     => ' id,nome',
                                                          :conditions => ["clase_id = 5"],
                                                          :order      => '2'),:id,:nome, { :include_blank => true } %>
---
SELECT id,nome FROM "produtos" WHERE (clase_id = 5) ORDER BY 2