app/views/vendas_produtos/_new_form_produto_E03.html.erb

SELECT id,nome FROM "depositos" ORDER BY 2
---
        <td align="right">Deposito :</td>
        <td><%= f.collection_select(  :deposito_id, Deposito.all(:select => 'id,nome',:order => '2'),:id,:nome,{},{:onkeyup => "EnterTab(event,'venda_produto_produto_busca_')"} )%></td>