app/views/vendas_produtos/create.js.erb

	$('#vendas_produtos').append("<%= escape_javascript(render(:partial => @vendas_produto)) %>");
	$("#sub_total").html("<%= number_to_currency(VendasProduto.sum(:total_guarani,   :conditions => ['venda_id = ?',@vendas_produto.venda_id]), :format=>' %n ', :precision => 0)%>");
---
SELECT SUM("vendas_produtos"."total_guarani") AS sum_id FROM "vendas_produtos" WHERE (venda_id = 55)