app/controllers/buscas_controller.rb

SELECT id FROM "unidades" WHERE "unidades"."id" = 1 LIMIT 1
---
  def get_unidade                     #
    unidade =  Unidade.find_by_id(params[:unidade], :select => 'id')

SELECT id FROM "usuarios" WHERE "usuarios"."id" = 1 LIMIT 1
---
  def get_usuario                     #
    usuario =  Usuario.find_by_id(params[:usuario], :select => 'id')

SELECT dolar_compra FROM "moedas" WHERE "moedas"."data" = '24/1/2013' LIMIT 1
---
  def cotz_us_compra
    moeda =  Moeda.find_by_data( params[:data], :select => 'dolar_compra')

SELECT "vendas".* FROM "vendas" WHERE "vendas"."id" = $1 LIMIT 1  [["id", "55"]]
SELECT "produtos".* FROM "produtos" WHERE "produtos"."fabricante_cod" = 'PT' LIMIT 1
SELECT "produtos".* FROM "produtos" WHERE "produtos"."barra" = 'p' LIMIT 1
SELECT SUM(entrada - saida) AS sum_id FROM "stocks" WHERE (produto_id = 18613 and deposito_id = '1' and data <= '2013-01-24')
---
  def busca_produto
    @venda = Venda.find(params[:id])
    prod   = Produto.find_by_fabricante_cod(params[:cod])    if params[:tipo_cod] == "CODIGO"
    prod   = Produto.find_by_barra(params[:cod]) if params[:tipo_cod] == "BARRA"

    stock  = Stock.sum('entrada - saida', :conditions => ["produto_id = ? and deposito_id = ? and data <= ?",prod.id, params[:deposito_id], @venda.data] )