app/controllers/compras_controller.rb

    def new_gasto            #
        @compra = Compra.new
        @setors = Setor.all(:select => 'id,nome', :order => '1')
---
SELECT id,nome FROM "setors" ORDER BY 1