app/controllers/fechamento_caixas_controller.rb

SELECT "fechamento_caixas".* FROM "fechamento_caixas" ORDER BY data,id
---
  def index
    @fechamento_caixas = FechamentoCaixa.all(:order => "data,id")

SELECT "fechamento_caixas".* FROM "fechamento_caixas" WHERE "fechamento_caixas"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @fechamento_caixa = FechamentoCaixa.find(params[:id])

SELECT "fechamento_caixas".* FROM "fechamento_caixas" WHERE "fechamento_caixas"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @fechamento_caixa = FechamentoCaixa.find(params[:id])

INSERT INTO "fechamento_caixas" ("conta_id", "conta_nome", "conta_viatico_id", "conta_viatico_nome", "contato01", "contato02", "contato03", "contato04", "cotacao", "created_at", "data", "entrada_cheq_dia_dolar", "entrada_cheq_dia_guarani", "entrada_cheq_dif_dolar", "entrada_cheq_dif_guarani", "entrada_efetivo_dolar", "entrada_efetivo_guarani", "obs", "qtd_entrada_cheq_dia_dolar", "qtd_entrada_cheq_dia_guarani", "qtd_entrada_cheq_dif_dolar", "qtd_entrada_cheq_dif_guarani", "qtd_saida_cheq_dia_dolar", "qtd_saida_cheq_dia_guarani", "qtd_saida_cheq_dif_dolar", "qtd_saida_cheq_dif_guarani", "saida_cheq_dia_dolar", "saida_cheq_dia_guarani", "saida_cheq_dif_dolar", "saida_cheq_dif_guarani", "saida_efetivo_dolar", "saida_efetivo_guarani", "status", "updated_at", "usuario_id", "usuario_nome") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36) RETURNING "id"
---
  def create
    @fechamento_caixa = FechamentoCaixa.new(params[:fechamento_caixa])
    respond_to do |format|
      if @fechamento_caixa.save

SELECT "fechamento_caixas".* FROM "fechamento_caixas" WHERE "fechamento_caixas"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "fechamento_caixas" SET "conta_id" = 10, "updated_at" = '2013-01-24 17:40:54.116821' WHERE "fechamento_caixas"."id" = 1
---
  def update
    @fechamento_caixa = FechamentoCaixa.find(params[:id])

    respond_to do |format|
      if @fechamento_caixa.update_attributes(params[:fechamento_caixa])