app/controllers/logins_controller.rb

SELECT "logins".* FROM "logins" WHERE (status != 2) ORDER BY "logins"."id" DESC LIMIT 1
SELECT id FROM "unidades" WHERE (id = '1') LIMIT 1
SELECT id,usuario_senha FROM "usuarios" WHERE (id = '1' and usuario_senha = 'di03051999') LIMIT 1
SELECT "empresas".* FROM "empresas" ORDER BY "empresas"."id" DESC LIMIT 1
---
  def logar
    @vencimento = Login.find(:last,:conditions => ["status != 2"])

    if session[:logged] and session[:unidade]
      redirect_to menu_path
    else

      @unidade = Unidade.find(:first,:select =>'id',:conditions   => ['id = ?',params[:busca]["unidade_id"]])
      @login   = Usuario.find(:first,:select =>'id,usuario_senha',:conditions => ['id = ? and usuario_senha = ?',params[:busca]["usuario_id"],params[:usuario_senha]])

      if @unidade and @login

        session[:unidade]   = params[:busca]["unidade_id"]
        session[:logged]    = params[:busca]["usuario_id"]
        flash[:notice]      = 'Logado con Sucesso!'
        ep = Empresa.last