app/controllers/meta_detalhes_controller.rb

  def create
    @meta_detalhe = MetaDetalhe.new(params[:meta_detalhe])

    respond_to do |format|
      if @meta_detalhe.save
---
INSERT INTO "meta_detalhes" ("comicao_max", "comicao_min", "created_at", "decimal", "descricao", "meta_id", "persona_id", "persona_nome", "setor_id", "setor_nome", "updated_at", "valor_max_gs", "valor_max_rs", "valor_max_us", "valor_min_gs", "valor_min_rs", "valor_min_us") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"

  def destroy
    @meta_detalhe = MetaDetalhe.find(params[:id])
    @meta_detalhe.destroy
---
SELECT "meta_detalhes".* FROM "meta_detalhes" WHERE "meta_detalhes"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "meta_detalhes" WHERE "meta_detalhes"."id" = $1  [["id", 1]]