app/controllers/produtos_controller.rb

SELECT id,nome FROM "produtos" WHERE (nome LIKE '%%')
---
    def index                        #
        @produtos = Produto.all(:select => 'id,nome', :conditions => ["nome LIKE ?","%#{params[:busca]}%"])

SELECT "produtos".* FROM "produtos" WHERE "produtos"."id" = $1 LIMIT 1  [["id", "6818"]]
---
    def edit                         #
        @produto = Produto.find(params[:id])