app/controllers/sub_grupos_controller.rb

  def index
    @sub_grupos = SubGrupo.all
---
SELECT "sub_grupos".* FROM "sub_grupos"