app/controllers/vendas_produtos_controller.rb

INSERT INTO "vendas_produtos" ("amostra_completa", "amostra_extratificante", "amostra_macro", "barra", "bomba_id", "bomba_nome", "clase_id", "clase_produto", "codigo", "conta_created", "conta_updated", "cotacao", "created_at", "data", "deposito_id", "deposito_nome", "desconto", "fabricante_cod", "grupo_id", "interes", "iva_dolar", "iva_guarani", "iva_real", "laboratorio_id", "laboratorio_nome", "lotes", "moeda", "nro_amostra", "numero_ordem", "persona_id", "persona_nome", "porcentagem", "preco_dolar", "preco_fixo_dolar", "preco_fixo_guarani", "preco_fixo_real", "preco_guarani", "preco_maiorista_guarani", "preco_mairista_dolar", "preco_real", "produto_cod", "produto_id", "produto_nome", "quantidade", "saldo", "sub_grupo_id", "taxa", "tipo", "tipo_ordem", "tipo_venda", "total_desconto", "total_dolar", "total_guarani", "total_real", "turno_created", "turno_updated", "unidade_created", "unidade_updated", "unitario_dolar", "unitario_guarani", "unitario_real", "updated_at", "usuario_created", "usuario_updated", "venda_id", "vendedor_id", "vendedor_nome") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47, $48, $49, $50, $51, $52, $53, $54, $55, $56, $57, $58, $59, $60, $61, $62, $63, $64, $65, $66, $67) RETURNING "id"
---
    def create                      #

      @vendas_produto = VendasProduto.create!(params[:vendas_produto])