app/controllers/vendas_controller.rb

SELECT "vendas".* FROM "vendas" WHERE "vendas"."id" = $1 LIMIT 1  [["id", "53"]]
SELECT SUM("vendas_produtos"."quantidade") AS sum_id FROM "vendas_produtos" WHERE (venda_id = '53')
SELECT SUM("vendas_produtos"."total_dolar") AS sum_id FROM "vendas_produtos" WHERE (venda_id = '53')
SELECT SUM("vendas_produtos"."total_guarani") AS sum_id FROM "vendas_produtos" WHERE (venda_id = '53')
SELECT SUM("vendas_produtos"."total_real") AS sum_id FROM "vendas_produtos" WHERE (venda_id = '53')
SELECT "vendas_financas".* FROM "vendas_financas" WHERE "vendas_financas"."venda_id" = 53 ORDER BY 1
SELECT SUM("vendas_financas"."valor_dolar_contado") AS sum_id FROM "vendas_financas" WHERE (venda_id = '53' and tipo = 0)
SELECT SUM("vendas_financas"."valor_guarani_contado") AS sum_id FROM "vendas_financas" WHERE (venda_id = '53' and tipo = 0)
SELECT SUM("vendas_financas"."cota_dolar_01") AS sum_id FROM "vendas_financas" WHERE (venda_id = '53' and tipo = 1)
SELECT SUM("vendas_financas"."cota_guarani_01") AS sum_id FROM "vendas_financas" WHERE (venda_id = '53' and tipo = 1)
SELECT COUNT("vendas_financas"."id") FROM "vendas_financas" WHERE (venda_id = '53' AND tipo = 1)
---
  def vendas_financa                       #
      @venda = Venda.find(params[:id])
      @produto_count       = VendasProduto.sum(:quantidade,:conditions => ['venda_id = ?',params[:id]] )
      @produto_sum_dolar   = VendasProduto.sum(:total_dolar,:conditions => ['venda_id = ?',params[:id]] )
      @produto_sum_guarani = VendasProduto.sum(:total_guarani,:conditions => ['venda_id = ?',params[:id]] )
      @produto_sum_real    = VendasProduto.sum(:total_real, :conditions => ['venda_id = ?',params[:id]] )
      contado_us           = VendasFinanca.sum(:valor_dolar_contado,:conditions => ['venda_id = ? and tipo = 0',params[:id]] )
      contado_gs           = VendasFinanca.sum(:valor_guarani_contado,:conditions => ['venda_id = ? and tipo = 0',params[:id]] )
      credito_us           = VendasFinanca.sum(:cota_dolar_01,:conditions => ['venda_id = ? and tipo = 1',params[:id]] )
      credito_gs           = VendasFinanca.sum(:cota_guarani_01,:conditions => ['venda_id = ? and tipo = 1',params[:id]] )
      @financa_sum_dolar   = contado_us.to_f + credito_us.to_f
      @financa_sum_guarani = contado_gs.to_f + credito_gs.to_f

      @produto_iva_guarani = VendasProduto.sum('iva_guarani * quantidade',:conditions => ['venda_id = ?',params[:id]] )
      @produto_iva_dolar   = VendasProduto.sum('iva_dolar * quantidade',:conditions => ['venda_id = ?',params[:id]] )
      @count               = VendasFinanca.count(:id,:conditions => ['venda_id = ? AND tipo = 1',params[:id]] )

SELECT "vendas".* FROM "vendas" WHERE "vendas"."id" = $1 LIMIT 1  [["id", "53"]]
SELECT "vendas_produtos".* FROM "vendas_produtos" WHERE (venda_id = '53') ORDER BY id
SELECT SUM("vendas_produtos"."total_guarani") AS sum_id FROM "vendas_produtos" WHERE (venda_id = '53')
SELECT SUM("vendas_produtos"."total_dolar") AS sum_id FROM "vendas_produtos" WHERE (venda_id = '53')
SELECT "vendas_financas".* FROM "vendas_financas" WHERE (venda_id = '53' AND tipo = 1) ORDER BY "vendas_financas"."id" DESC LIMIT 1
SELECT SUM("vendas_financas"."cota_guarani_01") AS sum_id FROM "vendas_financas" WHERE (venda_id = '53' AND tipo = 1)
SELECT SUM("vendas_financas"."cota_dolar_01") AS sum_id FROM "vendas_financas" WHERE (venda_id = '53' AND tipo = 1)
---
  def comprovante                          #
      @venda           = Venda.find(params[:id])
      @venda_produto   = VendasProduto.all(:conditions => ['venda_id = ?',params[:id]],:order => 'id' )
      @produto_sum_gs  = VendasProduto.sum(:total_guarani,:conditions => ['venda_id = ?',params[:id]] )
      @produto_sum_us  = VendasProduto.sum(:total_dolar,:conditions => ['venda_id = ?',params[:id]] )
      @fin_sum_gs  = VendasFinanca.sum(:cota_guarani_01,:conditions => ['venda_id = ? AND tipo = 1',params[:id]] )
      @fin_sum_us  = VendasFinanca.sum(:cota_dolar_01,:conditions => ['venda_id = ? AND tipo = 1',params[:id]] )

SELECT "vendas".* FROM "vendas" WHERE "vendas"."id" = $1 LIMIT 1  [["id", "53"]]
SELECT "vendas_produtos".* FROM "vendas_produtos" WHERE (venda_id = '53') ORDER BY id
SELECT SUM("vendas_produtos"."total_guarani") AS sum_id FROM "vendas_produtos" WHERE (venda_id = '53')
SELECT SUM("vendas_produtos"."total_dolar") AS sum_id FROM "vendas_produtos" WHERE (venda_id = '53')
SELECT "vendas_financas".* FROM "vendas_financas" WHERE (venda_id = '53' AND tipo = 1) ORDER BY "vendas_financas"."id" DESC LIMIT 1
SELECT SUM("vendas_financas"."cota_guarani_01") AS sum_id FROM "vendas_financas" WHERE (venda_id = '53' AND tipo = 1)
SELECT SUM("vendas_financas"."cota_dolar_01") AS sum_id FROM "vendas_financas" WHERE (venda_id = '53' AND tipo = 1)
---
  def ticket                          #
      @venda           = Venda.find(params[:id])
      @venda_produto   = VendasProduto.all(:conditions => ['venda_id = ?',params[:id]],:order => 'id' )
      @produto_sum_gs  = VendasProduto.sum(:total_guarani,:conditions => ['venda_id = ?',params[:id]] )
      @produto_sum_us  = VendasProduto.sum(:total_dolar,:conditions => ['venda_id = ?',params[:id]] )
      @fin_sum_gs  = VendasFinanca.sum(:cota_guarani_01,:conditions => ['venda_id = ? AND tipo = 1',params[:id]] )
      @fin_sum_us  = VendasFinanca.sum(:cota_dolar_01,:conditions => ['venda_id = ? AND tipo = 1',params[:id]] )

SELECT "vendas".* FROM "vendas" WHERE "vendas"."id" = $1 LIMIT 1  [["id", "53"]]
SELECT SUM("vendas_produtos"."total_guarani") AS sum_id FROM "vendas_produtos" WHERE (venda_id = '53')
SELECT id,moeda,lotes,fabricante_cod,deposito_nome,produto_nome,quantidade,unitario_dolar,total_dolar,unitario_guarani,total_guarani,total_desconto,iva_dolar,iva_guarani FROM "vendas_produtos" WHERE "vendas_produtos"."venda_id" = 53 ORDER BY id
SELECT SUM("vendas_produtos"."total_real") AS sum_id FROM "vendas_produtos" WHERE (venda_id = '53')
---
  def show                                 #
      @venda = Venda.find(params[:id])
      @vp  =  VendasProduto.find_all_by_venda_id(params[:id],:select =>'id,moeda,lotes,fabricante_cod,deposito_nome,produto_nome,quantidade,unitario_dolar,total_dolar,unitario_guarani,total_guarani,total_desconto,iva_dolar,iva_guarani',:order => 'id')
      @total_produto     =  VendasProduto.sum(:quantidade,    :conditions => ['venda_id = ?',params[:id]])
      @total_dolar       =  VendasProduto.sum(:total_dolar,   :conditions => ['venda_id = ?',params[:id]])
      @total_guarani     =  VendasProduto.sum(:total_guarani, :conditions => ['venda_id = ?',params[:id]])
      @total_real        =  VendasProduto.sum(:total_real, :conditions => ['venda_id = ?',params[:id]])

SELECT "empresas".* FROM "empresas" ORDER BY "empresas"."id" DESC LIMIT 1
SELECT "moedas".* FROM "moedas" ORDER BY data DESC, id DESC LIMIT 1
INSERT INTO "vendas" ("acessorio", "autori_motivo", "bairro", "chassi", "cidade_id", "cidade_nome", "clase_produto", "classificacao", "conta_created", "conta_id", "conta_nome", "conta_updated", "cor", "cotacao", "cotacao_real", "created_at", "data", "data_entrega", "desconto_dolar", "desconto_guarani", "direcao", "documento_id", "documento_nome", "documento_numero", "documento_numero_01", "documento_numero_02", "exentas", "fatura", "gravada_05", "gravada_10", "imposto_05", "imposto_10", "limite_credito", "local_cobro", "local_venda", "marca", "mecanico_id", "mecanico_nome", "modelo", "moeda", "numero_ordem", "pedido", "pedido_id", "pedido_numero", "persona_cod", "persona_id", "persona_nome", "quantidade", "ruc", "saldo_disponivel", "serie", "solicitacao", "status", "telefone", "tipo", "tipo_maiorista", "tipo_ordem", "tipo_venda", "total_dolar", "total_guarani", "turno_created", "turno_updated", "unidade_created", "unidade_updated", "updated_at", "usuario_created", "usuario_updated", "vendedor_id", "vendedor_nome") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47, $48, $49, $50, $51, $52, $53, $54, $55, $56, $57, $58, $59, $60, $61, $62, $63, $64, $65, $66, $67, $68, $69) RETURNING "id"
---
  def new_balcao
      empresa = Empresa.last
      ctz     = Moeda.last(:order => "data, id")

      @venda = Venda.new( :persona_id   => empresa.venda_persona_id,
                          :persona_nome => empresa.venda_persona_nome,
                          :moeda        => empresa.venda_moeda,
                          :data         => Time.now,
                          :tipo_maiorista => 0,
                          :cotacao      => ctz.dolar_compra.to_f,
                          :cotacao_real => ctz.real_compra.to_f,
                          :pedido_id => 0)
      @venda.save