app/views/vendas/eps/_comprovante_E03.html.erb

SELECT "produtos".* FROM "produtos" WHERE "produtos"."id" = 10282 LIMIT 1
---
					<% @venda_produto.each do |produto| %>
					<% prod = Produto.find_by_id(produto.produto_id)  %>