app/views/vendas/eps/_new_financa_E05.html.erb

                      <td align="right">Cuenta :</td>
                      <td width="251"><%= f.collection_select :conta_id, Conta.all( :select     =>' id,nome',:conditions => ["tipo = 0"],:order      => '1'), :id,:nome,{},{:onkeypress  => "return bloqEnter(event)",:onkeyup => "EnterTab(event,'vendas_financa_cheque_status')"} %></td>
---
SELECT id,nome FROM "contas" WHERE (tipo = 0) ORDER BY 1

                      <td>
                        <%= f.collection_select :vendedor_id, Persona.all( :select     => ' id,nome,tipo_vendedor',
                          :conditions => ["tipo_vendedor = 1"],
                          :order      => '2'),:nome,:nome %>
---
SELECT id,nome,tipo_vendedor FROM "personas" WHERE (tipo_vendedor = 1) ORDER BY 2

                   <% if current_user.tipo == 2 %>
                   <% numero = Fatura.maximum(:documento_numero,:conditions => ["documento_numero_02 = '002'"])%>
---
SELECT MAX("faturas"."documento_numero") AS max_id FROM "faturas" WHERE (documento_numero_02 = '001')