app/views/compras/eps/_form_gasto_E02.html.erb

SELECT id,unidade_nome FROM "unidades" ORDER BY 1
---
                              <td align="right">Unidade:</td>
                              <td><%= f.collection_select :unidade_id, Unidade.all(:select => 'id,unidade_nome',:order => '1'),:id,:unidade_nome %></td>

SELECT id,nome FROM "setors" ORDER BY 1
---

                                 <%= f.collection_select :clase_produto, Setor.all( :select => 'id,nome',
                                                                                           :order  => '1' ),:id,
                                                                                            :nome %>

SELECT id,descricao FROM "rubros" ORDER BY 2
---
                                 <td align="right">Rubro:</td>
                                 <td><%= f.collection_select :rubro_id,
                                           Rubro.all( :select => 'id,descricao',
                                                      :order  => '2' ),:id,
                                                      :descricao,{},
                                                       {:class => "selc_medium"} %></td>

SELECT id,placa FROM "rodados" ORDER BY 2
---
                                 <td align="right">Rodados:</td>
                                 <td><%= f.collection_select :rodado_id,
                                           Rodado.all( :select => 'id,placa',
                                                       :order  => '2' ),:id,:placa,
                                                       {:include_blank => true },
                                                       {:class         => "selc_medium"} %> Cantidad <%= f.text_field :qtd,:size => 15 %> L</td>

SELECT id,nome FROM "personas" WHERE (tipo_funcionario = 1) ORDER BY 1
---
                                 <td align="right">Vendedor:</td>
                                 <td><%= f.collection_select :empregado_id,
                                            Persona.all( :conditions => ["tipo_funcionario = 1"],
                                                         :select => 'id,nome',
                                                         :order  => '1' ),:id,
                                                         :nome, { :include_blank => true },
                                                         {:class         => "selc_medium"} %>

SELECT id,nome FROM "documentos" ORDER BY 1
---
                                 <td align="right">Documento:</td>
                                 <td><%= f.collection_select :documento_id, Documento.all( :select => 'id,nome',
                                                                                           :order  => '1' ),:id,
                                                                                            :nome %>