app/views/vendas/busca_vendas.html.erb

         <% @vendas.each do |venda| %>
            <% count_produto = VendasProduto.count(:id,:conditions    => ['venda_id = ?',venda.id]) %>
            <% count_financa = VendasFinanca.count(:id,:conditions    => ['venda_id = ?',venda.id]) %>
---
SELECT COUNT("vendas_produtos"."id") FROM "vendas_produtos" WHERE (venda_id = 54)
SELECT COUNT("vendas_financas"."id") FROM "vendas_financas" WHERE (venda_id = 54)